namespace EAU.Migr.Documents.Domain
{
    public static class DocumentTypeUrisMigr
    {
        /// <summary>
        /// Заявление за издаване на документ, удостоверяващ наличието на чуждо гражданство, постоянен адрес, настоящ адрес, адрес на 
        /// пребиваване, предоставено право на пребиваване/ разрешен срок, основание/за влизане и напускане на Република България, както 
        /// и за други събития и факти, свързани с пребиваването на чужденци в Република България и гражданите на ЕС
        /// </summary>
        public const string ApplicationForIssuingDocumentForForeigners = "0010-003115";
    }
}